www/app/Controllers/Home.php

    public function users()
    {
        $accountModel = new \App\Models\accountModel();
        $account = $accountModel->findAll();
        //count all
        $builder = $this->db->table('tblaccount');
        $builder->select('COUNT(accountID)total');
        $total = $builder->get()->getResult();
---
SELECT *
FROM `tblaccount`
SELECT COUNT(accountID)total
FROM `tblaccount`

    public function searchAccount()
    {
        $text = "%".$this->request->getGet('keyword')."%";
        $builder = $this->db->table('tblaccount');
        $builder->select('*');
        $builder->LIKE('Fullname',$text);
        $data = $builder->get();
---
SELECT *
FROM `tblaccount`
WHERE `Fullname` LIKE '%%%%' ESCAPE '!'

    public function fetchZones()
    {
        $builder = $this->db->table('tblzone');
        $builder->select('zoneID,Name,DateCreated');
        $data = $builder->get();
---
SELECT `zoneID`, `Name`, `DateCreated`
FROM `tblzone`

    public function fetchRegions()
    {
        $builder = $this->db->table('tblregion a');
        $builder->select('a.RegionName,a.DateCreated,a.regionID,b.Name');
        $builder->join('tblzone b','b.zoneID=a.zoneID','LEFT');
        $data = $builder->get();
---
SELECT `a`.`RegionName`, `a`.`DateCreated`, `a`.`regionID`, `b`.`Name`
FROM `tblregion` `a`
LEFT JOIN `tblzone` `b` ON `b`.`zoneID`=`a`.`zoneID`
SELECT *
FROM `tblzone`

    public function searchRegions()
    {
        $val = "%".$this->request->getGet('keyword')."%";
        $builder = $this->db->table('tblregion a');
        $builder->select('a.RegionName,a.DateCreated,a.regionID,b.Name');
        $builder->join('tblzone b','b.zoneID=a.zoneID','LEFT');
        $builder->LIKE('a.RegionName',$val);
        $data = $builder->get();
---
SELECT `a`.`RegionName`, `a`.`DateCreated`, `a`.`regionID`, `b`.`Name`
FROM `tblregion` `a`
LEFT JOIN `tblzone` `b` ON `b`.`zoneID`=`a`.`zoneID`
WHERE `a`.`RegionName` LIKE '%%ce%%' ESCAPE '!'

    public function fetchBranches()
    {
        $builder = $this->db->table('tblbranches a');
        $builder->select('a.*,b.RegionName,c.Name');
        $builder->join('tblregion b','b.regionID=a.regionID','LEFT');
        $builder->join('tblzone c','c.zoneID=a.zoneID','LEFT');
        $builder->groupBy('a.branchID')
        ->orderBy('a.BranchCode','ASC')
        ->orderBy('b.RegionName','ASC');
        $data = $builder->get();
---
SELECT `a`.*, `b`.`RegionName`, `c`.`Name`
FROM `tblbranches` `a`
LEFT JOIN `tblregion` `b` ON `b`.`regionID`=`a`.`regionID`
LEFT JOIN `tblzone` `c` ON `c`.`zoneID`=`a`.`zoneID`
GROUP BY `a`.`branchID`
ORDER BY `a`.`BranchCode` ASC, `b`.`RegionName` ASC